app/controllers/todos_controller.rb

    def update
        todo = user.todos.find(params[:id]).update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["priority", 1], ["updated_at", "2023-03-23 09:54:38.415786"], ["id", 1]]

    def destroy
        user.todos.find(params[:id]).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    def index
        todos = user.todos.all
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 2]]